import React from 'react';

const AboutProject = () => {
  return (
    <>
      <h3>О проекте</h3>
      <hr />
      <div>
        <p>Дипломный проект включал 5 этапов</p>
        <p>
          Составление плана, работу над бэкендом, вёрстку, добавление
          функциональности и финальные доработки.
        </p>
      </div>

      <div>
        <p>На выполнение диплома ушло 5 недель</p>
        <p>
          У каждого этапа был мягкий и жёсткий дедлайн, которые нужно было
          соблюдать, чтобы успешно защититься.
        </p>
      </div>

      <div>
        <span>1 неделя</span>
        <span>4 недели</span>
      </div>
    </>
  );
};

export default AboutProject;
